logs/soap-request.log.json

[
  {
    "timestamp": "2026-02-05T09:16:14.166Z",
    "soapEnvelope": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:16:23.312Z",
    "soapEnvelope": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:16:27.322Z",
    "soapEnvelope": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:16:41.376Z",
    "soapEnvelope": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:17:47.889Z",
    "soapEnvelope": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "time": "2026-02-05T09:19:06.977Z",
    "soapXml": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:21:29.333Z",
    "soapXml": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  },
  {
    "timestamp": "2026-02-05T09:28:53.883Z",
    "soapXml": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:ns=\"http://www.concor.com/cil/EmptyTrailer/1.0/\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns:EmptyTrailer>\n      <ns:PermitNumber>GPMN208057</ns:PermitNumber>\n    </ns:EmptyTrailer>\n  </soapenv:Body>\n</soapenv:Envelope>"
  }
]